lfazio/rv32cortex-m/src/platform/stm32n6/stm32n6xx_hal_conf.h
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_conf.h
  *
  * Started from the vendor's stm32n6xx_hal_conf_template.h and trimmed to
  * the modules this firmware links. **Not renamed from another family's**:
  * CLAUDE.md records the F4-to-F7 move, where a renamed F4 config left the
  * ART accelerator off because the two families spell the option
  * differently -- INSTRUCTION_CACHE_ENABLE against ART_ACCELERATOR_ENABLE
  * -- and nothing said so.
  * @author  MCD Application Team
  * @brief   HAL configuration template file.
  *          This file should be copied to the application folder and renamed
  *          to stm32n6xx_hal_conf.h.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32N6xx_HAL_CONF_H
#define STM32N6xx_HAL_CONF_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* ########################## Module Selection ############################## */
/**
  * @brief This is the list of modules to be used in the HAL driver
  */
#define HAL_MODULE_ENABLED
/*#define HAL_ADC_MODULE_ENABLED      */
/*#define HAL_BSEC_MODULE_ENABLED     */
/*#define HAL_CRC_MODULE_ENABLED      */
/*#define HAL_CRYP_MODULE_ENABLED     */
/*#define HAL_DCMI_MODULE_ENABLED     */
/*#define HAL_DCMIPP_MODULE_ENABLED   */
/*#define HAL_DMA2D_MODULE_ENABLED    */
/*#define HAL_DTS_MODULE_ENABLED      */
/*#define HAL_ETH_MODULE_ENABLED      */
/*#define HAL_EXTI_MODULE_ENABLED     */
/*#define HAL_FDCAN_MODULE_ENABLED    */
/*#define HAL_GFXMMU_MODULE_ENABLED   */
/*#define HAL_GFXTIM_MODULE_ENABLED   */
/*#define HAL_HASH_MODULE_ENABLED     */
/*#define HAL_HCD_MODULE_ENABLED      */
/*#define HAL_I2C_MODULE_ENABLED      */
/*#define HAL_I2S_MODULE_ENABLED      */
/*#define HAL_I3C_MODULE_ENABLED      */
/*#define HAL_ICACHE_MODULE_ENABLED   */
/*#define HAL_IRDA_MODULE_ENABLED     */
/*#define HAL_IWDG_MODULE_ENABLED     */
/*#define HAL_JPEG_MODULE_ENABLED     */
/*#define HAL_LPTIM_MODULE_ENABLED    */
/*#define HAL_LTDC_MODULE_ENABLED     */
/*#define HAL_MCE_MODULE_ENABLED      */
/*#define HAL_MDF_MODULE_ENABLED      */
/*#define HAL_MMC_MODULE_ENABLED      */
/*#define HAL_NAND_MODULE_ENABLED     */
/*#define HAL_NOR_MODULE_ENABLED      */
/*#define HAL_PCD_MODULE_ENABLED      */
/*#define HAL_PKA_MODULE_ENABLED      */
/*#define HAL_PSSI_MODULE_ENABLED     */
/*#define HAL_RAMCFG_MODULE_ENABLED   */
/*#define HAL_RIF_MODULE_ENABLED      */
/*#define HAL_RNG_MODULE_ENABLED      */
/*#define HAL_RTC_MODULE_ENABLED      */
/*#define HAL_SAI_MODULE_ENABLED      */
/*#define HAL_SD_MODULE_ENABLED       */
/*#define HAL_SDIO_MODULE_ENABLED     */
/*#define HAL_SDRAM_MODULE_ENABLED    */
/*#define HAL_SMARTCARD_MODULE_ENABLED*/
/*#define HAL_SMBUS_MODULE_ENABLED    */
/*#define HAL_SPDIFRX_MODULE_ENABLED  */
/*#define HAL_SPI_MODULE_ENABLED      */
/*#define HAL_SRAM_MODULE_ENABLED     */
/*#define HAL_TIM_MODULE_ENABLED      */
/*#define HAL_UART_MODULE_ENABLED     */
/*#define HAL_USART_MODULE_ENABLED    */
/*#define HAL_WWDG_MODULE_ENABLED     */
/*#define HAL_XSPI_MODULE_ENABLED     */
/*#define HAL_CACHEAXI_MODULE_ENABLED */
/*#define HAL_MDIOS_MODULE_ENABLED    */
/*#define HAL_GPU2D_MODULE_ENABLED    */
/*#define HAL_CACHEAXI_MODULE_ENABLED */
/*
 * What this firmware actually uses, enabled here rather than by
 * uncommenting the template's list above -- so that a diff against
 * stm32n6xx_hal_conf_template.h shows exactly what was chosen.
 *
 * It is a short list because the guest owns the peripherals: everything
 * beyond bringing the part up and opening a console belongs in a guest
 * driver reaching real registers through the passthrough window. Adding
 * a HAL module here is almost always the wrong fix.
 *
 * **Do not rename an F4 or F7 conf file into this.** The families spell
 * things differently in ways that compile: F4 has
 * INSTRUCTION_CACHE_ENABLE / DATA_CACHE_ENABLE where F7 has
 * ART_ACCELERATOR_ENABLE, and a renamed file leaves the accelerator off
 * with nothing to show for it. This one started from the N6 family's own
 * template.
 */
#define HAL_GPIO_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED

/* ########################## Oscillator Values adaptation ####################*/
/**
  * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSE is used as system clock source, directly or through the PLL).
  */
#if !defined  (HSE_VALUE)
#define HSE_VALUE              48000000UL /*!< Value of the External oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT    100UL   /*!< Time out for HSE start up, in ms */
#endif /* HSE_STARTUP_TIMEOUT */

/**
  * @brief External Low Speed oscillator (LSE) value.
  *        This value is used by the UART, RTC HAL module to compute the system frequency
  */
#if !defined  (LSE_VALUE)
#define LSE_VALUE              32768UL   /*!< Value of the External oscillator in Hz */
#endif /* LSE_VALUE */

#if !defined  (LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT    5000UL     /*!< Time out for LSE start up, in ms */
#endif /* LSE_STARTUP_TIMEOUT */

/**
  * @brief Internal Multiple Speed oscillator (MSI) default value.
  *        This value is the default MSI range value after Reset.
  */
#if !defined  (MSI_VALUE)
#define MSI_VALUE              4000000UL /*!< Value of the Internal oscillator in Hz */
#endif /* MSI_VALUE */

/**
  * @brief Internal High Speed oscillator (HSI) value.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSI is used as system clock source, directly or through the PLL).
  */
#if !defined  (HSI_VALUE)
#define HSI_VALUE              64000000UL /*!< Value of the Internal oscillator in Hz */
#endif /* HSI_VALUE */

/**
  * @brief Internal Low Speed oscillator (LSI) value.
  */
#if !defined  (LSI_VALUE)
#define LSI_VALUE               32000UL    /*!< LSI Typical Value in Hz */
#endif /* LSI_VALUE */                     /*!< Value of the Internal Low Speed oscillator in Hz */
/* The real value may vary depending on the variations in voltage and temperature.*/

/**
 * @brief External clock source for digital audio interfaces: SPI/I2S, SAI and ADF
 *        This value is used by the RCC HAL module to provide the digital audio interfaces
 *        frequency. This clock source is inserted directly through I2S_CKIN pad.
 */
#if !defined(EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE      12288000UL /*!< Value of the external clock source in Hz */
#endif /* EXTERNAL_CLOCK_VALUE */

