lfazio/rv32cortex-m/src/platform/stm32n6/stm32n6xx_hal_conf.h
/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/**
  * @brief This is the HAL system configuration section
  */
#define  VDD_VALUE                  3300UL /*!< Value of VDD in mv */
#define  TICK_INT_PRIORITY          15U  /*!< tick interrupt priority (lowest by default) */
#define  USE_RTOS                   0U

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1U */

/* ################## Register callback feature configuration ############### */
/**
  * @brief Set below the peripheral configuration  to "1U" to add the support
  *        of HAL callback registration/unregistration feature for the HAL
  *        driver(s). This allows user application to provide specific callback
  *        functions thanks to HAL_PPP_RegisterCallback() rather than overwriting
  *        the default weak callback functions (see each stm32n6xx_hal_ppp.h file
  *        for possible callback identifiers defined in HAL_PPP_CallbackIDTypeDef
  *        for each PPP peripheral).
  */
#define  USE_HAL_ADC_REGISTER_CALLBACKS       0U /* ADC register callback disabled       */
#define  USE_HAL_CACHEAXI_REGISTER_CALLBACKS  0U /* CACHEAXI register callback disabled  */
#define  USE_HAL_CRYP_REGISTER_CALLBACKS      0U /* CRYP register callback disabled      */
#define  USE_HAL_DCMI_REGISTER_CALLBACKS      0U /* DCMI register callback disabled      */
#define  USE_HAL_DCMIPP_REGISTER_CALLBACKS    0U /* DCMIPP register callback disabled    */
#define  USE_HAL_DMA2D_REGISTER_CALLBACKS     0U /* DMA2D register callback disabled     */
#define  USE_HAL_DTS_REGISTER_CALLBACKS       0U /* DTS register callback disabled       */
#define  USE_HAL_ETH_REGISTER_CALLBACKS       0U /* ETH register callback disabled       */
#define  USE_HAL_FDCAN_REGISTER_CALLBACKS     0U /* FDCAN register callback disabled     */
#define  USE_HAL_GFXMMU_REGISTER_CALLBACKS    0U /* GFXMMU register callback disabled    */
#define  USE_HAL_GFXTIM_REGISTER_CALLBACKS    0U /* GFXTIM register callback disabled    */
#define  USE_HAL_HASH_REGISTER_CALLBACKS      0U /* HASH register callback disabled      */
#define  USE_HAL_HCD_REGISTER_CALLBACKS       0U /* HCD register callback disabled       */
#define  USE_HAL_I2C_REGISTER_CALLBACKS       0U /* I2C register callback disabled       */
#define  USE_HAL_I2S_REGISTER_CALLBACKS       0U /* I2S register callback disabled       */
#define  USE_HAL_I3C_REGISTER_CALLBACKS       0U /* I3C register callback disabled       */
#define  USE_HAL_IWDG_REGISTER_CALLBACKS      0U /* IWDG register callback disabled      */
#define  USE_HAL_IRDA_REGISTER_CALLBACKS      0U /* IRDA register callback disabled      */
#define  USE_HAL_LPTIM_REGISTER_CALLBACKS     0U /* LPTIM register callback disabled     */
#define  USE_HAL_LTDC_REGISTER_CALLBACKS      0U /* LTDC register callback disabled      */
#define  USE_HAL_MCE_REGISTER_CALLBACKS       0U /* MCE register callback disabled       */
#define  USE_HAL_MDF_REGISTER_CALLBACKS       0U /* MDF register callback disabled       */
#define  USE_HAL_MMC_REGISTER_CALLBACKS       0U /* MMC register callback disabled       */
#define  USE_HAL_NAND_REGISTER_CALLBACKS      0U /* NAND register callback disabled      */
#define  USE_HAL_NOR_REGISTER_CALLBACKS       0U /* NOR register callback disabled       */
#define  USE_HAL_PCD_REGISTER_CALLBACKS       0U /* PCD register callback disabled       */
#define  USE_HAL_PKA_REGISTER_CALLBACKS       0U /* PKA register callback disabled       */
#define  USE_HAL_PSSI_REGISTER_CALLBACKS      0U /* PSSI register callback disabled      */
#define  USE_HAL_RAMCFG_REGISTER_CALLBACKS    0U /* RAMCFG register callback disabled    */
#define  USE_HAL_RNG_REGISTER_CALLBACKS       0U /* RNG register callback disabled       */
#define  USE_HAL_RTC_REGISTER_CALLBACKS       0U /* RTC register callback disabled       */
#define  USE_HAL_SAI_REGISTER_CALLBACKS       0U /* SAI register callback disabled       */
#define  USE_HAL_SD_REGISTER_CALLBACKS        0U /* SD register callback disabled        */
#define  USE_HAL_SDIO_REGISTER_CALLBACKS      0U /* SDIO register callback disabled      */
#define  USE_HAL_SDRAM_REGISTER_CALLBACKS     0U /* SDRAM register callback disabled     */
#define  USE_HAL_SMARTCARD_REGISTER_CALLBACKS 0U /* SMARTCARD register callback disabled */
#define  USE_HAL_SMBUS_REGISTER_CALLBACKS     0U /* SMBUS register callback disabled     */
#define  USE_HAL_SPDIFRX_REGISTER_CALLBACKS   0U /* SPDIFRX register callback disabled   */
#define  USE_HAL_SPI_REGISTER_CALLBACKS       0U /* SPI register callback disabled       */
#define  USE_HAL_SRAM_REGISTER_CALLBACKS      0U /* SRAM register callback disabled      */
#define  USE_HAL_TIM_REGISTER_CALLBACKS       0U /* TIM register callback disabled       */
#define  USE_HAL_UART_REGISTER_CALLBACKS      0U /* UART register callback disabled      */
#define  USE_HAL_USART_REGISTER_CALLBACKS     0U /* USART register callback disabled     */
#define  USE_HAL_WWDG_REGISTER_CALLBACKS      0U /* WWDG register callback disabled      */
#define  USE_HAL_XSPI_REGISTER_CALLBACKS      0U /* XSPI register callback disabled      */

/* ################## SPI peripheral configuration ########################## */

/* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
 * Activated: CRC code is present inside driver
 * Deactivated: CRC code cleaned from driver
 */
#define USE_SPI_CRC                   0U

/* ################## SDMMC peripheral configuration ######################### */

#define USE_SD_TRANSCEIVER            0U

/* ################## SDIO peripheral configuration ########################## */
#define USE_SDIO_TRANSCEIVER          1U
#define SDIO_MAX_IO_NUMBER            7U /*!< SDIO device support maximum IO number */

/* Includes ------------------------------------------------------------------*/
/**
  * @brief Include module's header file
  */
#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32n6xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32n6xx_hal_gpio.h"
#endif /* HAL_GPIO_MODULE_ENABLED */

